### `#` Importing Libraries:

In [1]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

### `#` Loading Data:

In [ ]:
data = pd.read_csv('Salaries.csv')

### `#` Simple Analysis:

In [22]:
print(f"Shape Of Data : {data.shape}")
print(f'With Columns : {data.columns.to_list()}')

Shape Of Data : (786, 10)
With Columns : ['TimeStamp', 'Title', 'Years of Experiences ', 'Salary', 'Date of Salary', 'What Is your Company', 'Work Type', 'Work Hour', 'City of Company site', 'Result']

In [23]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 786 entries, 0 to 785
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   TimeStamp              786 non-null    object
 1   Title                  786 non-null    object
 2   Years of Experiences   786 non-null    object
 3   Salary                 786 non-null    object
 4   Date of Salary         786 non-null    object
 5   What Is your Company   786 non-null    object
 6   Work Type              786 non-null    object
 7   Work Hour              786 non-null    object
 8   City of Company site   729 non-null    object
 9   Result                 786 non-null    int64
dtypes: int64(1), object(9)
memory usage: 61.5+ KB

In [26]:
data.duplicated().sum()

2

In [ ]:
data.isna().sum()

TimeStamp                 0
Title                     0
Years of Experiences      0
Salary                    0
Date of Salary            0
What Is your Company      0
Work Type                 0
Work Hour                 0
City of Company site     57
Result                    0
dtype: int64

In [46]:
for column in data.columns:
    print(data[column].value_counts())
    print('-------------------------------------------')

TimeStamp
7/17/2025 10:41    4
7/16/2025 20:12    4
7/16/2025 20:31    4
7/16/2025 20:24    3
7/17/2025 15:13    3
                  ..
7/17/2025 10:12    1
7/17/2025 10:14    1
7/17/2025 10:16    1
7/17/2025 10:17    1
8/8/2025 0:49      1
Name: count, Length: 673, dtype: int64
-------------------------------------------
Title
Flutter Developer                13
Software Engineer                12
Data Analyst                     10
Frontend Developer                7
Android Developer                 7
                                 ..
Soc analyst tier1                 1
Computer vision engineer          1
Full stack dot net developer      1
Nodejs developer                  1
Retail Analyst                    1
Name: count, Length: 583, dtype: int64
-------------------------------------------
Years of Experiences
1              147
2              145
3              109
4               69
5               53
              ...
0.65             1
11               1
3.9              1
less than 1      1
Fresh            1
Name: count, Length: 71, dtype: int64
-------------------------------------------
Salary
30000           35
20000           31
15000           31
12000           29
40000           23
                ..
1100 dollar      1
3500 USD         1
90K EGP          1
13k              1
8800             1
Name: count, Length: 290, dtype: int64
-------------------------------------------
Date of Salary
7/1/2025      98
7/17/2025     78
1/1/2025      72
7/16/2025     66
6/1/2025      36
              ..
3/16/2025      1
6/17/2025      1
11/15/2024     1
2/28/2015      1
8/30/2024      1
Name: count, Length: 153, dtype: int64
-------------------------------------------
What Is your Company
Egyption                                                                                   472
Not Egyption but site in egypt                                                             214
Not Egyption and site out of egypt                                                          84
corporate                                                                                    3
Egyptian but all work outside Egypt                                                          1
I don't own a company                                                                        1
Fully remote operations                                                                      1
morocco                                                                                      1
Startup in canada , but there?s no site just online work and the whole team from Egypt       1
.                                                                                            1
Ag                                                                                           1
Egyptian and site out of Egypt                                                               1
Else                                                                                         1
Multinational                                                                                1
DXC                                                                                          1
Saudi backdoor (dev team in Egypt)                                                           1
Egyptian but have offices in Egypt, KSA, the UAE, and others                                 1
Name: count, dtype: int64
-------------------------------------------
Work Type
Hybird                  312
Remotley                237
On Site                 232
Depends On Project        1
Remote Hourly based       1
.                         1
Anything                  1
Any of them?              1
Name: count, dtype: int64
-------------------------------------------
Work Hour
Full Time    760
Part Time     24
.              1
Anything       1
Name: count, dtype: int64
-------------------------------------------
City of Company site
Cairo                  312
Cairo                   70
cairo                   53
Giza                    26
Alexandria              23
                      ...
dubai                    1
Sudia                    1
Cairo,maadi              1
riyadh saudi arabia      1
Baghdad                  1
Name: count, Length: 155, dtype: int64
-------------------------------------------
Result
0    786
Name: count, dtype: int64
-------------------------------------------

In [49]:
for column in data.columns:
    print(f'unique values of {column} :\n {data[column].nunique()}')

unique values of TimeStamp :
 673
unique values of Title :
 583
unique values of Years of Experiences  :
 71
unique values of Salary :
 290
unique values of Date of Salary :
 153
unique values of What Is your Company :
 17
unique values of Work Type :
 8
unique values of Work Hour :
 4
unique values of City of Company site :
 155
unique values of Result :
 1

In [51]:
data.describe(include = object)

,TimeStamp,Title,Years of Experiences,Salary,Date of Salary,What Is your Company,Work Type,Work Hour,City of Company site
count,786,786,786,786,786,786,786,786,729
unique,673,583,71,290,153,17,8,4,155
top,7/17/2025 10:41,Flutter Developer,1,30000,7/1/2025,Egyption,Hybird,Full Time,Cairo
freq,4,13,147,35,98,472,312,760,312

### `#` City To Country Column:

In [ ]:
# Unique Values In City Column
data['City of Company site2'].unique()

array(['Cairo ', 'Cairo', 'Australia', 'Alexandria', 'New Cairo ',
       'Kuwait', 'Saudi Arabia', 'UK', 'Dubai', 'Giza', 'Jordan ', 'USA',
       'Mansoura', 'Bahrain', 'Canada', 'Bany swef', 'Germany',
       'Lebnanon', 'El-Minia', 'Tanta', 'No sites ', 'New Cairo', 'USA ',
       'UAE', 'Georgia', 'Mansoura ', 'Suez', 'Poland', 'Abu Dhabi',
       'Marsa Alam', 'Qalyubia', 'New capital ', 'France', 'Zagazig ',
       'London', 'Oman', 'Sharqia', 'Denmark', 'Kuwait ', 'Morocco',
       'Switzerland', 'Jordan', 'New Capital ', 'Iraq', 'Germany '],
      dtype=object)

In [ ]:
# Length Of City Values
for val in data["City of Company site2"].unique():
    print(f"Value: {repr(val)} - Length: {len(val)}")

Value: 'Cairo ' - Length: 6
Value: 'Cairo' - Length: 5
Value: 'Australia' - Length: 9
Value: 'Alexandria' - Length: 10
Value: 'New Cairo ' - Length: 10
Value: 'Kuwait' - Length: 6
Value: 'Saudi Arabia' - Length: 12
Value: 'UK' - Length: 2
Value: 'Dubai' - Length: 5
Value: 'Giza' - Length: 4
Value: 'Jordan ' - Length: 7
Value: 'USA' - Length: 3
Value: 'Mansoura' - Length: 8
Value: 'Bahrain' - Length: 7
Value: 'Canada' - Length: 6
Value: 'Bany swef' - Length: 9
Value: 'Germany' - Length: 7
Value: 'Lebnanon' - Length: 8
Value: 'El-Minia' - Length: 8
Value: 'Tanta' - Length: 5
Value: 'No sites ' - Length: 9
Value: 'New Cairo' - Length: 9
Value: 'USA ' - Length: 4
Value: 'UAE' - Length: 3
Value: 'Georgia' - Length: 7
Value: 'Mansoura ' - Length: 9
Value: 'Suez' - Length: 4
Value: 'Poland' - Length: 6
Value: 'Abu Dhabi' - Length: 9
Value: 'Marsa Alam' - Length: 10
Value: 'Qalyubia' - Length: 8
Value: 'New capital ' - Length: 12
Value: 'France' - Length: 6
Value: 'Zagazig ' - Length: 8
Value: 'London' - Length: 6
Value: 'Oman' - Length: 4
Value: 'Sharqia' - Length: 7
Value: 'Denmark' - Length: 7
Value: 'Kuwait ' - Length: 7
Value: 'Morocco' - Length: 7
Value: 'Switzerland' - Length: 11
Value: 'Jordan' - Length: 6
Value: 'New Capital ' - Length: 12
Value: 'Iraq' - Length: 4
Value: 'Germany ' - Length: 8

In [ ]:
# Format City Values
data['City of Company site2'] = data['City of Company site2'].str.strip()
data['City of Company site2'] = data['City of Company site2'].str.capitalize()

In [ ]:
# Mapping City To Country
city_to_country = {
    "Alexandria": "Egypt",
    "Bany swef": "Egypt",
    "Cairo": "Egypt",
    "El-minia": "Egypt",
    "Giza": "Egypt",
    "Mansoura": "Egypt",
    "Marsa alam": "Egypt",
    "New cairo": "Egypt",
    "New capital": "Egypt",
    "Sharqia": "Egypt",
    "Suez": "Egypt",
    "Tanta": "Egypt",
    "Zagazig": "Egypt",
    "Qalyubia": "Egypt",
    "Saudi arabia": "Saudi Arabia",
    "Abu dhabi": "United Arab Emirates",
    "Dubai": "United Arab Emirates",
    "Uae": "United Arab Emirates",
    "London": "United Kingdom",
    "Uk": "United Kingdom",
    "Usa": "United States of America",
    "Switzerland": "Switzerland",
    "Poland": "Poland",
    "Oman": "Oman",
    "Morocco": "Morocco",
    "Lebnanon": "Lebanon",
    "Kuwait": "Kuwait",
    "Jordan": "Jordan",
    "Iraq": "Iraq",
    "Germany": "Germany",
    "Georgia": "Georgia",
    "France": "France",
    "Denmark": "Denmark",
    "Canada": "Canada",
    "Bahrain": "Bahrain",
    "Australia": "Australia",
    "No sites" : "No Sites"
}

data['Country Site'] = data['City of Company site2'].map(city_to_country)
data

,Title,Years of Experiences,Salary,Date of Salary,What Is your Company,Company,Work Type,Work Hour,City of Company site,City of Company site2,Country Site
0,Front End,2,20000,6/30/2025,Egyption,Egyption,Remotley,Full Time,cairo,Cairo,Egypt
1,Full Stack .Net | Angular,3,26000,7/1/2025,Egyption,Egyption,Remotley,Full Time,Cairo,Cairo,Egypt
2,.Net Developsr,1.5 years,14000 EGP,6/1/2025,Egyption,Egyption,Remotley,Full Time,Cairo,Cairo,Egypt
3,IT Specialist,0,10000,5/1/2025,Egyption,Egyption,On Site,Full Time,"Maadi, Cairo",Cairo,Egypt
4,Front end,1,40000,7/16/2025,Not Egyption but site in egypt,Not Egyption but site in egypt,Hybird,Full Time,Cairo,Cairo,Egypt
...,...,...,...,...,...,...,...,...,...,...,...
788,.Net Developer,2,28000,8/1/2025,Egyption,Egyption,Hybird,Full Time,Cairo,Cairo,Egypt
789,AI Software R&D Engineer (AI/Backend/Frontend),1.5,20000,2/2/2025,Egyption,Egyption,Remotley,Full Time,Giza,Giza,Egypt
790,Senior Software Engineer,6,$4000,8/8/2025,Not Egyption and site out of egypt,Not Egyption and site out of egypt,Remotley,Full Time,Dubai,Dubai,United Arab Emirates
791,C++ Software Engineer,2.5,800$,8/8/2025,Not Egyption and site out of egypt,Not Egyption and site out of egypt,Remotley,Full Time,"Amman, Jordan",Jordan,Jordan
792,C++ (Embedded) Software Developer,3,35000,8/8/2025,Egyption,Egyption,Hybird,Full Time,Cairo,Cairo,Egypt

In [ ]:
data['Country Site'].isna().sum() # Check For Nulls

0

In [ ]:
data['Country Site'].unique() # Check After Mapping

array(['Egypt', 'Australia', 'Kuwait', 'Saudi Arabia', 'United Kingdom',
       'United Arab Emirates', 'Jordan', 'United States of America',
       'Bahrain', 'Canada', 'Germany', 'Lebanon', 'No Sites', 'Georgia',
       'Poland', 'France', 'Oman', 'Denmark', 'Morocco', 'Switzerland',
       'Iraq'], dtype=object)

### `#` Format Company Values:

In [55]:
data['Company'].unique()

array(['Egyption', 'Not Egyption but site in egypt', 'corporate',
       'Not Egyption and site out of egypt', 'Multinational ',
       'Egyptian ', 'Egyptian', nan], dtype=object)

In [ ]:
data['Company'] = data['Company'].str.strip() # Removing Spaces

In [ ]:
data['Compnay'] = data['Company'].replace('Egyption' , 'Egyptian') # Correcting 
# Correcting And Mapping Any Not Egyptian Company To Not Egyptian
data['Company'] = data['Company'].replace(['Not Egyption but site in egypt' , 'Not Egyption and site out of egypt'] , 'Not Egyptian')

In [ ]:
data['Company'].unique() # Check Values After Updating

array(['Egyptian', 'Not Egyptian', 'corporate', 'Multinational', nan],
      dtype=object)

In [ ]:
data[data['Company'].isna()] # Check For Nulls

,Title,Years of Experiences,Salary,Date of Salary,What Is your Company,Company,Work Type,Work Hour,City of Company site,City of Company site2,Country Site
688,"Backend and DevOps Engineer (NodeJS, Java, AWS...",3,42000,7/23/2025,Fully remote operations,NaN,Remotley,Full Time,NaN,No sites,No Sites

In [ ]:
# Dropping Null Row
data = data.dropna(subset=['Company'])

In [ ]:
# Checking Nulls After Dropping
data[data['Company'].isna()]

Empty DataFrame
Columns: [Title, Years of Experiences , Salary, Date of Salary, What Is your Company, Company, Work Type, Work Hour, City of Company site, City of Company site2, Country Site]
Index: []

In [ ]:
# Dropping Un Wanted Compnay Column
data.drop('Compnay' , inplace = True , axis = 1)

### `#` Format Work Type Column:

In [ ]:
data['Work Type'].unique()

array(['Remotley', 'On Site', 'Hybird', 'Depends On Project ',
       'Remotley (Hourly based) '], dtype=object)

In [ ]:
data['Work Type'] = data['Work Type'].str.strip() # Removing Spaces

In [ ]:
data['Work Type'] = data['Work Type'].replace('Remotley' , 'Remotely') # Correcting
data['Work Type'] = data['Work Type'].replace('Remotley (Hourly based)' , 'Remotely') # Correcting And Mapping

In [ ]:
data['Work Type'].unique() # Check Values After Updating

array(['Remotely', 'On Site', 'Hybird', 'Depends On Project'],
      dtype=object)

### `#` Format Work Hour Column:

In [88]:
data['Work Hour'].unique()

array(['Full Time', 'Part Time', 'Anything'], dtype=object)

In [ ]:
data['Work Hour'] = data['Work Hour'].str.strip() # Removing Spaces

In [ ]:
data['Work Hour'] = data['Work Hour'].replace('Anything' , 'Full Time') # Mapping

### `#` Adding Experinece Level Column:

In [11]:
def ex_level(x):
    if x >= 0 and x < 2:
        return 'Entry'
    elif x >= 2 and x < 5:
        return 'Mid'
    elif x >= 5 and x < 8:
        return 'Senior'
    elif x >= 8 and x < 12:
        return 'Lead'
    else:
        return 'Management'
    
data['Experience Level']  = data['Years of Experiences '].apply(ex_level)

### `#` Loading Data To Salaries File:

In [14]:
data.to_csv("Salaries.csv", index=False)